Janek1986/stm32g071_ws2811/Core/Src/ws2811_fx.c
#include "stm32g0xx_hal.h"
#include <stdlib.h>

#include "ws2811.h"
#include "ws2811_fx.h"

#define MIN(a,b) (((a)<(b))?(a):(b))
#define MAX(a,b) (((a)<(b))?(b):(a))

#define SEGMENT_LENGTH   (Ws28b11_Segments[mActualSegment].IdStop - Ws28b11_Segments[mActualSegment].IdStart + 1)
#define IS_REVERSE		Ws28b11_Segments[mActualSegment].Reverse

uint8_t 	mRunning;
uint8_t 	mTriggered;
uint8_t		mActualSegment;

uint16_t 	mSegments;

uint32_t		mColor[NUM_COLORS];
ws2811_color	mColor_w[NUM_COLORS];

typedef struct ws2811fx_s
{
	volatile uint32_t	ModeDelay;	// Segment SW timer counter

	uint16_t	IdStart;			// Start segment point
	uint16_t	IdStop;				// End segment point

	uint8_t 	Running : 1;		// Is sector running
	uint8_t		ActualMode; 		// Sector mode setting
	uint8_t		Reverse : 1;		// Is reverted mode
	uint32_t	CounterModeCall;	// Numbers of calls
	uint32_t	CounterModeStep;	// Call step

	uint16_t		Speed;			// Segment speed

	uint32_t		ModeColor[NUM_COLORS];		// Mode color 32 bit representation
	ws2811_color	ModeColor_w[NUM_COLORS]; 	// Mode color struct representation

	uint8_t 	AuxParam;			// Computing variable
	uint16_t 	AuxParam16b;		// Computing variable
	uint8_t 	Cycle : 1;			// Cycle variable

	void 	(*mModeCallback)(void); // Sector mode callback
} ws2811fx_s;

ws2811fx_s *Ws28b11_Segments = NULL;

void (*mModeCallback)(void);


/*
 *
 *  MODES
 *
 * */
void
strip_off(void),
mode_static(void),
mode_white_to_color(void),
mode_black_to_color(void),
mode_blink(void),
mode_blink_rainbow(void),
mode_strobe(void),
mode_strobe_rainbow(void),
mode_breath(void),
mode_color_wipe(void),
mode_color_wipe_inv(void),
mode_color_wipe_rev(void),
mode_color_wipe_rev_inv(void),
mode_color_wipe_random(void),
mode_color_sweep_random(void),
mode_random_color(void),
mode_single_dynamic(void),
mode_multi_dynamic(void),
mode_rainbow(void),
mode_rainbow_cycle(void),
mode_fade(void),
mode_scan(void),
mode_dual_scan(void),
mode_theater_chase(void),
mode_theater_chase_rainbow(void),
mode_running_lights(void),
mode_twinkle(void),
mode_twinkle_random(void),
mode_twinkle_fade(void),
mode_twinkle_fade_random(void),
mode_sparkle(void),
mode_flash_sparkle(void),
mode_hyper_sparkle(void),
mode_multi_strobe(void),
mode_chase_white(void),
mode_chase_color(void),
mode_chase_random(void),
mode_chase_rainbow(void),
mode_chase_flash(void),
mode_chase_flash_random(void),
mode_chase_rainbow_white(void),
mode_chase_blackout(void),
mode_chase_blackout_rainbow(void),
mode_running_color(void),
mode_running_red_blue(void),
mode_running_random(void),
mode_larson_scanner(void),
mode_comet(void),
mode_fireworks(void),
mode_fireworks_random(void),
mode_merry_christmas(void),
mode_fire_flicker(void),
mode_fire_flicker_soft(void),
mode_fire_flicker_intense(void),
mode_circus_combustus(void),
mode_halloween(void),
mode_bicolor_chase(void),
mode_tricolor_chase(void),
mode_icu(void)
;

void (*mMode[MODE_COUNT])(void) =
{
	mode_static,
	mode_white_to_color,
	mode_black_to_color,
	mode_blink,
	mode_blink_rainbow,
	mode_strobe,
	mode_strobe_rainbow,
	mode_breath,
	mode_color_wipe,
	mode_color_wipe_inv,
	mode_color_wipe_rev,
	mode_color_wipe_rev_inv,
	mode_color_wipe_random,
	mode_color_sweep_random,
	mode_random_color,
    mode_single_dynamic,
    mode_multi_dynamic,
    mode_rainbow,
    mode_rainbow_cycle,
    mode_fade,
    mode_scan,
    mode_dual_scan,
    mode_theater_chase,
    mode_theater_chase_rainbow,
    mode_running_lights,
    mode_twinkle,
    mode_twinkle_random,
	mode_twinkle_fade,
	mode_twinkle_fade_random,
    mode_sparkle,
    mode_flash_sparkle,
    mode_hyper_sparkle,
	mode_multi_strobe,
    mode_chase_white,
    mode_chase_color,
    mode_chase_random,
    mode_chase_rainbow,
    mode_chase_flash,
    mode_chase_flash_random,
    mode_chase_rainbow_white,
    mode_chase_blackout,
    mode_chase_blackout_rainbow,
    mode_running_color,
    mode_running_red_blue,
    mode_running_random,
    mode_larson_scanner,
    mode_comet,
    mode_fireworks,
    mode_fireworks_random,
    mode_merry_christmas,
    mode_fire_flicker,
    mode_fire_flicker_soft,
    mode_fire_flicker_intense,
    mode_circus_combustus,
    mode_halloween,
    mode_bicolor_chase,
    mode_tricolor_chase,
    mode_icu
};

FX_STATUS WS2811FX_Init(uint16_t Segments)
{
	if(Segments == 0) return FX_ERROR;
	if(Segments > (WS2811_LEDS / 2))
	{
		if(Segments > WS2811_LEDS)
		{
			return FX_ERROR;
		}
	}

	uint16_t div = 0;
	ws2811fx_s *SegmentsTmp = NULL;

	SegmentsTmp = calloc(Segments, sizeof(ws2811fx_s));	// Assign the space for new segments

	if(SegmentsTmp == NULL) return FX_ERROR;	// If assigning failed

	if(Ws28b11_Segments == NULL)
	{
		mSegments = Segments;

		for(uint16_t i = 0; i < mSegments; i++)
		{
			SegmentsTmp[i].Speed = DEFAULT_SPEED;
			SegmentsTmp[i].Running = DEFAULT_MODE;

			SegmentsTmp[i].IdStart = div;
			div += ((WS2811_LEDS + 1) / Segments) - 1;
			SegmentsTmp[i].IdStop = div;
			if(SegmentsTmp[i].IdStop >= WS2811_LEDS) SegmentsTmp[i].IdStop = WS2811_LEDS - 1;
			div++;
		}
	}
	else	// Ws28b11_Segments was before initialized
	{
		for(uint16_t i = 0; i < (Segments>mSegments?mSegments:Segments); i++)
		{
			SegmentsTmp[i].ModeDelay = Ws28b11_Segments[i].ModeDelay;

			SegmentsTmp[i].IdStart = div;
			div += ((WS2811_LEDS + 1) / Segments) - 1;
			SegmentsTmp[i].IdStop = div;
			if(SegmentsTmp[i].IdStop >= WS2811_LEDS) Ws28b11_Segments[i].IdStop = WS2811_LEDS - 1;
			div++;

			SegmentsTmp[i].Running = Ws28b11_Segments[i].Running;
			SegmentsTmp[i].ActualMode = Ws28b11_Segments[i].ActualMode;
			SegmentsTmp[i].Reverse = Ws28b11_Segments[i].Reverse;
			SegmentsTmp[i].CounterModeCall = Ws28b11_Segments[i].CounterModeCall;
			SegmentsTmp[i].CounterModeStep = Ws28b11_Segments[i].CounterModeStep;
			SegmentsTmp[i].Speed = Ws28b11_Segments[i].Speed;
			for(uint8_t j = 0; j < NUM_COLORS; j++)
			{
				SegmentsTmp[i].ModeColor[j] = Ws28b11_Segments[i].ModeColor[j];
				SegmentsTmp[i].ModeColor_w[j] = Ws28b11_Segments[i].ModeColor_w[j];
			}
			SegmentsTmp[i].AuxParam = Ws28b11_Segments[i].AuxParam;
			SegmentsTmp[i].AuxParam16b = Ws28b11_Segments[i].AuxParam16b;
			SegmentsTmp[i].Cycle = Ws28b11_Segments[i].Cycle;
			SegmentsTmp[i].mModeCallback = Ws28b11_Segments[i].mModeCallback;
		}

		if(Segments > mSegments) // Add new Segment
		{
			SegmentsTmp[Segments - 1].Speed = DEFAULT_SPEED;
			SegmentsTmp[Segments - 1].ActualMode = DEFAULT_MODE;
			SegmentsTmp[Segments - 1].Running = 0; // Sany new segment is stopped by default

			SegmentsTmp[Segments - 1].IdStart = div;
			div += ((WS2811_LEDS + 1) / Segments) - 1;
			SegmentsTmp[Segments - 1].IdStop = WS2811_LEDS - 1;
		}

		mSegments = Segments;
	}

