Janek1986/stm32g071_ws2811/Core/Src/ws2811_fx.c
	free(Ws28b11_Segments);	// Free previous array if reinit
	Ws28b11_Segments = SegmentsTmp;
	return FX_OK;
}

uint8_t WS2811FX_GetSegmentsQuantity(void)
{
	return mSegments;
}

FX_STATUS WS2811FX_SegmentIncrease(void)
{
	if(mSegments < (WS2811_LEDS - 1))
	{
	 WS2811FX_Init(mSegments + 1);
	 return FX_OK;
	}
	return FX_ERROR;
}

FX_STATUS WS2811FX_SegmentDecrease(void)
{
	if(mSegments > 1)
	{
		WS2811FX_Init(mSegments - 1);
	 return FX_OK;
	}
	return FX_ERROR;
}

void WS2811FX_SysTickCallback(void)
{
	for(uint16_t i = 0; i < mSegments; i++)
		if(Ws28b11_Segments[i].ModeDelay > 0) Ws28b11_Segments[i].ModeDelay--;
}

void WS2811FX_Callback()
 {
	static uint8_t trig = 0;;
  if(mRunning || mTriggered)
  {
	  for(uint16_t i = 0; i < mSegments; i++)
	  {
		  if(Ws28b11_Segments[i].ModeDelay == 0)
		  {
			  if(Ws28b11_Segments[i].Running)
			  {
				  mActualSegment = i;
				  Ws28b11_Segments[i].mModeCallback();
				  Ws28b11_Segments[i].CounterModeCall++;
				  trig = 1;
			  }
		  }
	  }
	  if(trig)
	  {
		  WS2811_Refresh();
		  trig = 0;
	  }
  }
}

FX_STATUS WS2811FX_SetMode(uint16_t Segment, fx_mode Mode)
{
	if(Segment >= mSegments) return FX_ERROR;
	Ws28b11_Segments[Segment].CounterModeCall = 0;
	Ws28b11_Segments[Segment].CounterModeStep = 0;
	Ws28b11_Segments[Segment].ActualMode = Mode;
	Ws28b11_Segments[Segment].mModeCallback = mMode[Mode];
	for(uint8_t i = 0; i < NUM_COLORS; i++)
	{
		Ws28b11_Segments[Segment].ModeColor[i] = mColor[i];
		Ws28b11_Segments[Segment].ModeColor_w[i].red = mColor_w[i].red;
		Ws28b11_Segments[Segment].ModeColor_w[i].green = mColor_w[i].green;
		Ws28b11_Segments[Segment].ModeColor_w[i].blue = mColor_w[i].blue;
	}
	return FX_OK;
}

FX_STATUS WS2811FX_GetMode(uint16_t Segment, fx_mode *Mode)
{
	if(Segment >= mSegments) return FX_ERROR;
	*Mode = Ws28b11_Segments[Segment].ActualMode;
	return FX_OK;
}

FX_STATUS WS2811FX_NextMode(uint16_t Segment)
{
	if(Segment >= mSegments) return FX_ERROR;
	Ws28b11_Segments[Segment].CounterModeCall = 0;
	Ws28b11_Segments[Segment].CounterModeStep = 0;
	Ws28b11_Segments[Segment].ActualMode++;
	if(Ws28b11_Segments[Segment].ActualMode >= MODE_COUNT) Ws28b11_Segments[mActualSegment].ActualMode = 0;
	Ws28b11_Segments[Segment].mModeCallback = mMode[Ws28b11_Segments[mActualSegment].ActualMode];
	return FX_OK;
}

FX_STATUS WS2811FX_PrevMode(uint16_t Segment)
{
	if(Segment >= mSegments) return FX_ERROR;
	Ws28b11_Segments[Segment].CounterModeCall = 0;
	Ws28b11_Segments[Segment].CounterModeStep = 0;
	Ws28b11_Segments[Segment].ActualMode--;
	if(Ws28b11_Segments[Segment].ActualMode == 0) Ws28b11_Segments[mActualSegment].ActualMode = MODE_COUNT;
	Ws28b11_Segments[Segment].mModeCallback = mMode[Ws28b11_Segments[mActualSegment].ActualMode];
	return FX_OK;
}

FX_STATUS WS2811FX_SetReverse(uint16_t Segment, uint8_t Reverse)
{
	if(Segment >= mSegments) return FX_ERROR;
	WS2811FX_SetAll(Segment, BLACK); // Set all 'old' segment black

	if(Reverse > 1) Reverse = 1;

	Ws28b11_Segments[Segment].Reverse = Reverse;
	return FX_OK;
}

FX_STATUS WS2811FX_GetReverse(uint16_t Segment, uint8_t *Reverse)
{
	if(Segment >= mSegments) return FX_ERROR;
	*Reverse = Ws28b11_Segments[Segment].Reverse;
	return FX_OK;
}

FX_STATUS WS2811FX_SegmentIncreaseStart(uint16_t Segment)
{
	if(Segment >= mSegments) return FX_ERROR;
	WS2811FX_SetAll(Segment, BLACK); // Set all 'old' segment black

	if((Ws28b11_Segments[Segment].IdStop - Ws28b11_Segments[Segment].IdStart) > 0)
	{
		Ws28b11_Segments[Segment].IdStart++;
	}
	return FX_OK;
}

FX_STATUS WS2811FX_SegmentDecreaseStart(uint16_t Segment)
{
	if(Segment >= mSegments) return FX_ERROR;
	WS2811FX_SetAll(Segment, BLACK); // Set all 'old' segment black

	if(Segment > 0)
	{
		if(Ws28b11_Segments[Segment-1].IdStop < (Ws28b11_Segments[Segment].IdStart - 1))
		{
			Ws28b11_Segments[Segment].IdStart--;
		}
	}
	else // Segment == 0
	{
		if(0 < Ws28b11_Segments[Segment].IdStart)
		{
			Ws28b11_Segments[Segment].IdStart--;
		}
	}
	return FX_OK;
}

FX_STATUS WS2811FX_SegmentIncreaseEnd(uint16_t Segment)
{
	if(Segment >= mSegments) return FX_ERROR;
	WS2811FX_SetAll(Segment, BLACK); // Set all 'old' segment black

	if(Segment < (mSegments - 1))
	{
		if(Ws28b11_Segments[Segment].IdStop < (Ws28b11_Segments[Segment+1].IdStart - 1))
		{
			Ws28b11_Segments[Segment].IdStop++;
		}

	}
	else // last Segment
	{
		if(Ws28b11_Segments[Segment].IdStop < (WS2811_LEDS - 1))
		{
			Ws28b11_Segments[Segment].IdStop++;

		}
	}
	return FX_OK;
}

FX_STATUS WS2811FX_SegmentDecreaseEnd(uint16_t Segment)
{
	if(Segment >= mSegments) return FX_ERROR;
	WS2811FX_SetAll(Segment, BLACK); // Set all 'old' segment black

	if((Ws28b11_Segments[Segment].IdStop - Ws28b11_Segments[Segment].IdStart) > 0)
	{
		Ws28b11_Segments[Segment].IdStop--;
	}
	return FX_OK;
}

FX_STATUS WS2811FX_SetSegmentSize(uint16_t Segment, uint16_t Start, uint16_t Stop)
{
	if(Segment >= mSegments) return FX_ERROR;
	if(Start >= (WS2811_LEDS - 1)) return FX_ERROR;
	if(Stop >= (WS2811_LEDS - 1)) return FX_ERROR;
	if(Start > Stop) return FX_ERROR;

	WS2811FX_SetAll(Segment, BLACK); // Set all 'old' segment black

	Ws28b11_Segments[Segment].IdStart = Start;
	Ws28b11_Segments[Segment].IdStop = Stop;
	return FX_OK;
}

FX_STATUS WS2811FX_GetSegmentSize(uint16_t Segment, uint16_t *Start, uint16_t *Stop)
{
	if(Segment >= mSegments) return FX_ERROR;
	*Start = Ws28b11_Segments[Segment].IdStart;
	*Stop = Ws28b11_Segments[Segment].IdStop;
	return FX_OK;
}

FX_STATUS WS2811FX_Start(uint16_t Segment)
{
	if(Segment >= mSegments) return FX_ERROR;
	Ws28b11_Segments[Segment].CounterModeCall = 0;
	Ws28b11_Segments[Segment].CounterModeStep = 0;
	Ws28b11_Segments[Segment].ModeDelay = 0;
	Ws28b11_Segments[Segment].Running = 1;
	mRunning = 1;
	return FX_OK;
}

uint8_t WS2811FX_IsAnyRunning(void)
{
	for(uint8_t i = 0; i < mSegments; i++)
	{
		if(Ws28b11_Segments[i].Running != 0)
			return 1;
	}

	return 0;
}

FX_STATUS WS2811FX_Stop(uint16_t Segment)
{
	if(Segment >= mSegments) return FX_ERROR;
	Ws28b11_Segments[Segment].Running = 0;
	if(!WS2811FX_IsAnyRunning())
		mRunning = 0;
	return FX_OK;
//	  strip_off();
}

FX_STATUS WS2811FX_IsRunning(uint16_t Segment, uint8_t *Running)
{
	if(Segment >= mSegments) return FX_ERROR;
	*Running = Ws28b11_Segments[Segment].Running;
	return FX_OK;
}

