Janek1986/stm32g071_ws2811/Core/Src/ws2811_fx.c
void WS2811FX_SetColorStruct(uint8_t id, ws2811_color c)
{
	mColor[id] = ((c.red<<16)|(c.green<<8)|c.blue);
	mColor_w[id].red = c.red;
	mColor_w[id].green = c.green;
	mColor_w[id].blue = c.blue;
}

void WS2811FX_SetColorRGB(uint8_t id, uint8_t r, uint8_t g, uint8_t b)
{
	mColor[id] = ((r<<16)|(g<<8)|b);
	mColor_w[id].red = r;
	mColor_w[id].green = g;
	mColor_w[id].blue = b;

}

FX_STATUS WS2811FX_GetColorRGB(uint8_t id, uint8_t *r, uint8_t *g, uint8_t *b)
{
	if(id >= NUM_COLORS) return FX_ERROR;
	*r = mColor_w[id].red;
	*g = mColor_w[id].green;
	*b = mColor_w[id].blue;
	return FX_OK;
}

void WS2811FX_RGBtoHSV(uint8_t r, uint8_t g, uint8_t b, uint16_t *h, uint8_t *s, uint8_t *v)
{
    uint16_t min, max, delta;
    int16_t h_tmp = *h;

    min = r < g ? r : g;
    min = min  < b ? min : b;

    max = r > g ? r : g;
    max = max  > b ? max : b;

    *v = max;	// v
    delta = max - min;
    if (delta < 1)
    {
        *s = 0;
        *h = 0; // undefined, maybe nan?
        return;
    }
    if( max > 0 )
    { // NOTE: if Max is == 0, this divide would cause a crash
        *s = (((delta * 100) / max) * 255) / 100; // s
    }
    else
    {
        // if max is 0, then r = g = b = 0
        // s = 0, h is undefined
        *s = 0;
        *h = 0;                            // its now undefined
        return;
    }

    if( r == max )
    {
    	h_tmp = (( g - b )*100) / delta;        // between yellow & magenta
    											// *100 to avoid fracts
    }
    else
    {
		if( g == max )
		{
			h_tmp = 720 + (( b - r )*100) / delta;  // between cyan & yellow
		}
		else
		{
			h_tmp = 1440 + (( r - g )*100) / delta;  // between magenta & cyan
		}
    }
    h_tmp *= 60; // Degrees
    h_tmp /= 100; // Back from fracts

    if( h_tmp < 0.0 )
    	h_tmp += 360;

    *h = h_tmp;
}

void WS2811FX_HSVtoRGB(uint16_t h, uint8_t s, uint8_t v, uint8_t *r, uint8_t *g, uint8_t *b)
{
	uint16_t Sector, Fracts, p, q, t;

	if(s == 0)
	{

		*r = v;
		*g = v;
		*b = v;
	}
	else
	{
		if(h >= 360) h = 359;

		Sector = h / 60; // Sector 0 to 5
		Fracts = h % 60;
		p = (v * (255 - s)) / 256;
		q = (v * (255 - (s * Fracts)/60)) / 256;
		t = (v * (255 - (s * (59 - Fracts))/60)) / 256;


		switch(Sector)
		{
		case 0:
			*r = v;
			*g = (uint8_t)t;
			*b = (uint8_t)p;
			break;
		case 1:
			*r = (uint8_t)q;
			*g = v;
			*b = (uint8_t)p;
			break;
		case 2:
			*r = (uint8_t)p;
			*g = v;
			*b = (uint8_t)t;
			break;
		case 3:
			*r = (uint8_t)p;
			*g = (uint8_t)q;
			*b = v;
			break;
		case 4:
			*r = (uint8_t)t;
			*g = (uint8_t)p;
			*b = v;
			break;
		default:		// case 5:
			*r = v;
			*g = (uint8_t)p;
			*b = (uint8_t)q;
			break;
		}
	}
}

//
//	Set color with HSV model
//
//	Hue 		0-359
//	Saturation 	0-255
//	Value 		0-255
//
void WS2811FX_SetColorHSV(uint8_t id, uint16_t h, uint8_t s, uint8_t v)
{
	WS2811FX_HSVtoRGB(h, s, v, &mColor_w[id].red, &mColor_w[id].green, &mColor_w[id].blue);
	mColor[id] = ((mColor_w[id].red<<16)|(mColor_w[id].green<<8)|mColor_w[id]. blue);
}

void WS2811FX_SetColor(uint8_t id, uint32_t c)
{
	mColor[id] = c;
	mColor_w[id].red = ((c>>16)&0x000000FF);
	mColor_w[id].green = ((c>>8)&0x000000FF);
	mColor_w[id].blue = (c&0x000000FF);
}

FX_STATUS WS2811FX_SetAll(uint16_t Segment, uint32_t c)
{
	if(Segment >= mSegments) return FX_ERROR;
	for(uint16_t i = 0; i < (Ws28b11_Segments[Segment].IdStop - Ws28b11_Segments[Segment].IdStart + 1); i++)
	{
		WS2811_SetDiodeRGB(Ws28b11_Segments[Segment].IdStart + i, ((c>>16)&0xFF), ((c>>8)&0xFF), (c&0xFF));
	}
	return FX_OK;
}

FX_STATUS WS2811FX_SetAllRGB(uint16_t Segment, uint8_t r, uint8_t g, uint8_t b)
{
	if(Segment >= mSegments) return FX_ERROR;
	for(uint16_t i = 0; i < SEGMENT_LENGTH; i++)
	{
		WS2811_SetDiodeRGB(Ws28b11_Segments[Segment].IdStart + i, r, g, b);
	}
	return FX_OK;
}

FX_STATUS WS2811FX_SetSpeed(uint16_t Segment, uint16_t Speed)
{
	if(Segment >= mSegments) return FX_ERROR;
	if(Speed < SPEED_MIN) Speed = SPEED_MIN;
	if(Speed > SPEED_MAX) Speed = SPEED_MAX;

	Ws28b11_Segments[Segment].Speed = Speed;
	return FX_OK;
}

FX_STATUS WS2811FX_GetSpeed(uint16_t Segment, uint16_t *Speed)
{
	if(Segment >= mSegments) return FX_ERROR;
	*Speed = Ws28b11_Segments[Segment].Speed;
	return FX_OK;
}

FX_STATUS WS2811FX_IncreaseSpeed(uint16_t Segment, uint16_t Speed)
{
	return WS2811FX_SetSpeed(Segment, Ws28b11_Segments[mActualSegment].Speed + Speed);
}

FX_STATUS WS2811FX_DecreaseSpeed(uint16_t Segment, uint16_t Speed)
{
	return WS2811FX_SetSpeed(Segment, Ws28b11_Segments[mActualSegment].Speed - Speed);
}

//
//
// COLOR EFECTS FUNCTIONS
//
//

/*
 * Turns everything off.
 */
void strip_off()
{
	for(uint16_t i = 0; i < WS2811_LEDS; i++)
	{
		WS2811_SetDiodeRGB(i, 0, 0, 0);
	}
	WS2811_Refresh();
}

/*
 * Put a value 0 to 255 in to get a color value.
 * The colours are a transition r -> g -> b -> back to r
 * Inspired by the Adafruit examples.
 */
uint32_t color_wheel(uint8_t pos) {
  pos = 255 - pos;
  if(pos < 85) {
    return ((uint32_t)(255 - pos * 3) << 16) | ((uint32_t)(0) << 8) | (pos * 3);
  } else if(pos < 170) {
    pos -= 85;
    return ((uint32_t)(0) << 16) | ((uint32_t)(pos * 3) << 8) | (255 - pos * 3);
  } else {
    pos -= 170;
    return ((uint32_t)(pos * 3) << 16) | ((uint32_t)(255 - pos * 3) << 8) | (0);
  }
}

/*
 * Returns a new, random wheel index with a minimum distance of 42 from pos.
 */
uint8_t get_random_wheel_index(uint8_t pos) {
  uint8_t r = 0;
  uint8_t x = 0;
  uint8_t y = 0;
  uint8_t d = 0;

  while(d < 42) {
    r = rand()%256;
    x = abs(pos - r);
    y = 255 - x;
    d = MIN(x, y);
  }

  return r;
}

/*
 * fade out function
 */
void fade_out() {
  static const uint8_t rateMapH[] = {0, 1, 1, 1, 2, 3, 4, 6};
  static const uint8_t rateMapL[] = {0, 2, 3, 8, 8, 8, 8, 8};

  uint8_t rate  = FADE_RATE;
  uint8_t rateH = rateMapH[rate];
  uint8_t rateL = rateMapL[rate];

  uint32_t color = Ws28b11_Segments[mActualSegment].ModeColor[1]; // target color

  int r2 = (color >> 16) & 0xff;
  int g2 = (color >>  8) & 0xff;
  int b2 =  color        & 0xff;

  for(uint16_t i=Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++) {

