Janek1986/stm32g071_ws2811/Core/Src/ws2811_fx.c
    color = WS2811_GetColor(i);
    if(rate == 0) { // old fade-to-black algorithm
    	WS2811_SetDiodeColor(i, (color >> 1) & 0x7F7F7F7F);
    } else { // new fade-to-color algorithm
      int r1 = (color >> 16) & 0xff;
      int g1 = (color >>  8) & 0xff;
      int b1 =  color        & 0xff;

      // calculate the color differences between the current and target colors
      int rdelta = r2 - r1;
      int gdelta = g2 - g1;
      int bdelta = b2 - b1;

      // if the current and target colors are almost the same, jump right to the target color,
      // otherwise calculate an intermediate color. (fixes rounding issues)
      rdelta = abs(rdelta) < 3 ? rdelta : (rdelta >> rateH) + (rdelta >> rateL);
      gdelta = abs(gdelta) < 3 ? gdelta : (gdelta >> rateH) + (gdelta >> rateL);
      bdelta = abs(bdelta) < 3 ? bdelta : (bdelta >> rateH) + (bdelta >> rateL);

      WS2811_SetDiodeRGB(i, r1 + rdelta, g1 + gdelta, b1 + bdelta);
    }
  }
}

/*
 * color blend function
 */
uint32_t color_blend(uint32_t color1, uint32_t color2, uint8_t blend)
{
  if(blend == 0)   return color1;
  if(blend == 255) return color2;

  int w1 = (color1 >> 24) & 0xff;
  int r1 = (color1 >> 16) & 0xff;
  int g1 = (color1 >>  8) & 0xff;
  int b1 =  color1        & 0xff;

  int w2 = (color2 >> 24) & 0xff;
  int r2 = (color2 >> 16) & 0xff;
  int g2 = (color2 >>  8) & 0xff;
  int b2 =  color2        & 0xff;

  uint32_t w3 = ((w2 * blend) + (w1 * (255 - blend))) / 256;
  uint32_t r3 = ((r2 * blend) + (r1 * (255 - blend))) / 256;
  uint32_t g3 = ((g2 * blend) + (g1 * (255 - blend))) / 256;
  uint32_t b3 = ((b2 * blend) + (b1 * (255 - blend))) / 256;

  return ((w3 << 24) | (r3 << 16) | (g3 << 8) | (b3));
}

/*
 * No blinking. Just plain old static light.
 */
void mode_static(void)
{

  for(uint16_t i = Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++) {
	  WS2811_SetDiodeColorStruct(i, Ws28b11_Segments[mActualSegment].ModeColor_w[0]);
  }
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}

//
//	from: 0 - black to color, 1 - white to color
//
void to_color(uint8_t from)
{
	// HSV Saturatioin modifing
	uint16_t h;
	uint8_t s, v, r, g, b;

	WS2811FX_RGBtoHSV(Ws28b11_Segments[mActualSegment].ModeColor_w[0].red, Ws28b11_Segments[mActualSegment].ModeColor_w[0].green, Ws28b11_Segments[mActualSegment].ModeColor_w[0].blue, &h, &s, &v);

	if(from)
		WS2811FX_HSVtoRGB(h, s - Ws28b11_Segments[mActualSegment].CounterModeStep, v, &r, &g, &b);
	else
		WS2811FX_HSVtoRGB(h, s, v - Ws28b11_Segments[mActualSegment].CounterModeStep, &r, &g, &b);

	WS2811FX_SetAllRGB(mActualSegment, r, g, b);

	if(!Ws28b11_Segments[mActualSegment].Cycle)
	{
		if(from)
		{
			if(Ws28b11_Segments[mActualSegment].CounterModeStep < s)
				Ws28b11_Segments[mActualSegment].CounterModeStep++;
			else
				Ws28b11_Segments[mActualSegment].Cycle = 1;
		}
		else
		{
			if(Ws28b11_Segments[mActualSegment].CounterModeStep < v)
				Ws28b11_Segments[mActualSegment].CounterModeStep++;
			else
				Ws28b11_Segments[mActualSegment].Cycle = 1;
		}
	}
	else
	{
		if(Ws28b11_Segments[mActualSegment].CounterModeStep > 0)
			Ws28b11_Segments[mActualSegment].CounterModeStep--;
		else
			Ws28b11_Segments[mActualSegment].Cycle = 0;
	}

	if(from)
	{
		Ws28b11_Segments[mActualSegment].ModeDelay = (Ws28b11_Segments[mActualSegment].Speed / s / 2);
	}
	else
	{
		Ws28b11_Segments[mActualSegment].ModeDelay = (Ws28b11_Segments[mActualSegment].Speed / v / 2);
	}
}


void mode_white_to_color(void)
{
	to_color(1);
}

void mode_black_to_color(void)
{
	to_color(0);
}

//
//	Blink helper function
//
void blink(uint32_t color1, uint32_t color2, uint8_t strobe)
{
	uint32_t color = ((Ws28b11_Segments[mActualSegment].CounterModeCall & 1) == 0) ? color1 : color2;
	WS2811FX_SetAll(mActualSegment, color);
	if((Ws28b11_Segments[mActualSegment].CounterModeCall & 1) == 0)
		Ws28b11_Segments[mActualSegment].ModeDelay = strobe ? 20 : Ws28b11_Segments[mActualSegment].Speed / 2;
	else
		Ws28b11_Segments[mActualSegment].ModeDelay = strobe? Ws28b11_Segments[mActualSegment].Speed - 20 : (Ws28b11_Segments[mActualSegment].Speed / 2);
}

/*
 * Normal blinking. 50% on/off time.
 */
void mode_blink(void)
{
	blink(Ws28b11_Segments[mActualSegment].ModeColor[0], Ws28b11_Segments[mActualSegment].ModeColor[1], 0);
}

void mode_blink_rainbow(void)
{
	blink(color_wheel(Ws28b11_Segments[mActualSegment].CounterModeCall & 0xFF), Ws28b11_Segments[mActualSegment].ModeColor[1], 0);
}

void mode_strobe(void) {
	blink(Ws28b11_Segments[mActualSegment].ModeColor[0], Ws28b11_Segments[mActualSegment].ModeColor[1], 1);
}

void mode_strobe_rainbow(void)
{
	blink(color_wheel(Ws28b11_Segments[mActualSegment].CounterModeCall & 0xFF), Ws28b11_Segments[mActualSegment].ModeColor[1], 1);
}

/*
 * Breathing effect
 */
void mode_breath(void)
{
	uint32_t lum = Ws28b11_Segments[mActualSegment].CounterModeStep;
	if(lum > 255) lum = 511 - lum;

	uint16_t delay;
	if(lum == 15) delay = 970; // 970 pause before each breath
	else if(lum <=  25) delay = 38; // 19
	else if(lum <=  50) delay = 36; // 18
	else if(lum <=  75) delay = 28; // 14
	else if(lum <= 100) delay = 20; // 10
	else if(lum <= 125) delay = 14; // 7
	else if(lum <= 150) delay = 11; // 5
	else delay = 10; // 4

	uint8_t r = Ws28b11_Segments[mActualSegment].ModeColor_w[0].red * lum / 256;
	uint8_t g = Ws28b11_Segments[mActualSegment].ModeColor_w[0].green * lum / 256;
	uint8_t b = Ws28b11_Segments[mActualSegment].ModeColor_w[0].blue * lum / 256;

	WS2811FX_SetAllRGB(mActualSegment, r, g, b);
	Ws28b11_Segments[mActualSegment].CounterModeStep += 2;
	if(Ws28b11_Segments[mActualSegment].CounterModeStep > (512-15)) Ws28b11_Segments[mActualSegment].CounterModeStep = 15;
	Ws28b11_Segments[mActualSegment].ModeDelay = delay;
}

/*
 * Color wipe function
 * LEDs are turned on (color1) in sequence, then turned off (color2) in sequence.
 * if (bool rev == true) then LEDs are turned off in reverse order
 */
void color_wipe(uint32_t color1, uint32_t color2, uint8_t rev)
{
    if(Ws28b11_Segments[mActualSegment].CounterModeStep < SEGMENT_LENGTH)
    {
    	uint32_t led_offset = Ws28b11_Segments[mActualSegment].CounterModeStep;
        if(rev)
        {
        	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - led_offset, color1);
        }
        else
        {
        	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + led_offset, color1);
        }
    }
	else
	{
	    uint32_t led_offset = Ws28b11_Segments[mActualSegment].CounterModeStep - SEGMENT_LENGTH;
        if(rev)
        {
        	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - led_offset, color2);
        }
        else
        {
        	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + led_offset, color2);
        }

