Janek1986/stm32g071_ws2811/Core/Src/ws2811_fx.c
    }
    Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) % (SEGMENT_LENGTH * 2);
    Ws28b11_Segments[mActualSegment].ModeDelay =  Ws28b11_Segments[mActualSegment].Speed;
}

/*
 * Lights all LEDs one after another.
 */
void mode_color_wipe(void)
{
	color_wipe(Ws28b11_Segments[mActualSegment].ModeColor[0], Ws28b11_Segments[mActualSegment].ModeColor[1], 0);
}

void mode_color_wipe_inv(void)
{
	color_wipe(Ws28b11_Segments[mActualSegment].ModeColor[1], Ws28b11_Segments[mActualSegment].ModeColor[0], 0);
}

void mode_color_wipe_rev(void)
{
	color_wipe(Ws28b11_Segments[mActualSegment].ModeColor[0], Ws28b11_Segments[mActualSegment].ModeColor[1], 1);
}

void mode_color_wipe_rev_inv(void)
{
	color_wipe(Ws28b11_Segments[mActualSegment].ModeColor[1], Ws28b11_Segments[mActualSegment].ModeColor[0], 1);
}

void mode_color_wipe_random(void)
{
	if(Ws28b11_Segments[mActualSegment].CounterModeStep % SEGMENT_LENGTH == 0)
	{
	  Ws28b11_Segments[mActualSegment].AuxParam = get_random_wheel_index(Ws28b11_Segments[mActualSegment].AuxParam);
	}
	uint32_t color = color_wheel(Ws28b11_Segments[mActualSegment].AuxParam);

	color_wipe(color, color, 0);
	Ws28b11_Segments[mActualSegment].ModeDelay =  Ws28b11_Segments[mActualSegment].Speed;
}

/*
 * Random color introduced alternating from start and end of strip.
 */
void mode_color_sweep_random(void)
{
  if(Ws28b11_Segments[mActualSegment].CounterModeStep % SEGMENT_LENGTH == 0)
  { // aux_param will store our random color wheel index
	  Ws28b11_Segments[mActualSegment].AuxParam = get_random_wheel_index(Ws28b11_Segments[mActualSegment].AuxParam);
  }
  uint32_t color = color_wheel(Ws28b11_Segments[mActualSegment].AuxParam);
  color_wipe(color, color, 1);
}

/*
 * Lights all LEDs in one random color up. Then switches them
 * to the next random color.
 */
void mode_random_color(void)
{
	Ws28b11_Segments[mActualSegment].AuxParam = get_random_wheel_index(Ws28b11_Segments[mActualSegment].AuxParam); // aux_param will store our random color wheel index
	WS2811FX_SetAll(mActualSegment, color_wheel(Ws28b11_Segments[mActualSegment].AuxParam));
	Ws28b11_Segments[mActualSegment].ModeDelay =  Ws28b11_Segments[mActualSegment].Speed;
}

/*
 * Lights every LED in a random color. Changes one random LED after the other
 * to another random color.
 */
void mode_single_dynamic(void)
{
	if(Ws28b11_Segments[mActualSegment].CounterModeCall == 0)
	{
		for(uint16_t i = Ws28b11_Segments[mActualSegment].IdStop; i <= Ws28b11_Segments[mActualSegment].IdStop; i++)
		{
			WS2811_SetDiodeColor(i, color_wheel(rand()%256));
		}
	}

	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + rand() % SEGMENT_LENGTH, color_wheel(rand()%256));
	Ws28b11_Segments[mActualSegment].ModeDelay =  Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * Lights every LED in a random color. Changes all LED at the same time
 * to new random colors.
 */
void mode_multi_dynamic(void)
{
	for(uint16_t i = Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++)
	{
		WS2811_SetDiodeColor(i, color_wheel(rand()%256));
	}
	Ws28b11_Segments[mActualSegment].ModeDelay =  Ws28b11_Segments[mActualSegment].Speed;
}

/*
 * Cycles all LEDs at once through a rainbow.
 */
void mode_rainbow(void)
{
  uint32_t color = color_wheel(Ws28b11_Segments[mActualSegment].CounterModeStep);
  for(uint16_t i = Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++)
  {
	  WS2811_SetDiodeColor(i, color);
  }

  Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) & 0xFF;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * Cycles a rainbow over the entire string of LEDs.
 */
void mode_rainbow_cycle(void)
{
  for(uint16_t i=0; i < SEGMENT_LENGTH; i++)
  {
	  uint32_t color = color_wheel(((i * 256 / SEGMENT_LENGTH) + Ws28b11_Segments[mActualSegment].CounterModeStep) & 0xFF);
	  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + i, color);
  }

  Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) & 0xFF;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * Fades the LEDs between two colors
 */
void mode_fade(void) {
  int lum = Ws28b11_Segments[mActualSegment].CounterModeStep;
  if(lum > 255) lum = 511 - lum; // lum = 0 -> 255 -> 0

  uint32_t color = color_blend(Ws28b11_Segments[mActualSegment].ModeColor[0], Ws28b11_Segments[mActualSegment].ModeColor[1], lum);

  for(uint16_t i=Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++) {
    WS2811_SetDiodeColor(i, color);
  }

  Ws28b11_Segments[mActualSegment].CounterModeStep += 4;
  if(Ws28b11_Segments[mActualSegment].CounterModeStep > 511) Ws28b11_Segments[mActualSegment].CounterModeStep = 0;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * Runs a single pixel back and forth.
 */
void mode_scan(void) {
  if(Ws28b11_Segments[mActualSegment].CounterModeStep > (SEGMENT_LENGTH * 2) - 3) {
    Ws28b11_Segments[mActualSegment].CounterModeStep = 0;
  }

  for(uint16_t i = Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++) {
    WS2811_SetDiodeColor(i, Ws28b11_Segments[mActualSegment].ModeColor[1]);
  }

  int led_offset = Ws28b11_Segments[mActualSegment].CounterModeStep - (SEGMENT_LENGTH - 1);
  led_offset = abs(led_offset);

  if(IS_REVERSE) {
    WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - led_offset, Ws28b11_Segments[mActualSegment].ModeColor[0]);
  } else {
    WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + led_offset, Ws28b11_Segments[mActualSegment].ModeColor[0]);
  }


  Ws28b11_Segments[mActualSegment].CounterModeStep++;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


