Janek1986/stm32g071_ws2811/Core/Src/ws2811_fx.c
/*
 * Runs two pixel back and forth in opposite directions.
 */
void mode_dual_scan(void) {
  if(Ws28b11_Segments[mActualSegment].CounterModeStep > (SEGMENT_LENGTH * 2) - 3)
  {
    Ws28b11_Segments[mActualSegment].CounterModeStep = 0;
  }

  for(uint16_t i=Ws28b11_Segments[mActualSegment].IdStart; i <Ws28b11_Segments[mActualSegment].IdStop; i++)
  {
    WS2811_SetDiodeColor(i, Ws28b11_Segments[mActualSegment].ModeColor[1]);
  }

  int led_offset = Ws28b11_Segments[mActualSegment].CounterModeStep - (SEGMENT_LENGTH - 1);
  led_offset = abs(led_offset);

  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + led_offset, Ws28b11_Segments[mActualSegment].ModeColor[0]);
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + SEGMENT_LENGTH - led_offset - 1, Ws28b11_Segments[mActualSegment].ModeColor[0]);

  Ws28b11_Segments[mActualSegment].CounterModeStep++;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}

/*
 * theater chase function
 */
void theater_chase(uint32_t color1, uint32_t color2)
{
	Ws28b11_Segments[mActualSegment].CounterModeCall = Ws28b11_Segments[mActualSegment].CounterModeCall % 3;
  for(uint16_t i=0; i < SEGMENT_LENGTH; i++) {
    if((i % 3) == Ws28b11_Segments[mActualSegment].CounterModeCall) {
      if(IS_REVERSE) {
    	  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - i, color1);
      } else {
    	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + i, color1);
      }
    } else {
      if(IS_REVERSE) {
        WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - i, color2);
      } else {
    	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + i, color2);
      }
    }
  }
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * Theatre-style crawling lights.
 * Inspired by the Adafruit examples.
 */
void mode_theater_chase(void)
{

  return theater_chase(Ws28b11_Segments[mActualSegment].ModeColor[0], Ws28b11_Segments[mActualSegment].ModeColor[1]);
}


/*
 * Theatre-style crawling lights with rainbow effect.
 * Inspired by the Adafruit examples.
 */
void mode_theater_chase_rainbow(void)
{

	Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) & 0xFF;
	theater_chase(color_wheel(Ws28b11_Segments[mActualSegment].CounterModeStep), BLACK);
}

/*
 * Running lights effect with smooth sine transition.
 */
void mode_running_lights(void) {
  uint8_t r = ((Ws28b11_Segments[mActualSegment].ModeColor[0] >> 16) & 0xFF);
  uint8_t g = ((Ws28b11_Segments[mActualSegment].ModeColor[0] >>  8) & 0xFF);
  uint8_t b =  (Ws28b11_Segments[mActualSegment].ModeColor[0]        & 0xFF);

  uint8_t sineIncr = MAX(1, (256 / WS2811_LEDS));
  for(uint16_t i=0; i < SEGMENT_LENGTH; i++) {
    int lum = (int)sine8(((i + Ws28b11_Segments[mActualSegment].CounterModeStep) * sineIncr));
    if(IS_REVERSE) {
    WS2811_SetDiodeRGB(Ws28b11_Segments[mActualSegment].IdStart + i,  (r * lum) / 256, (g * lum) / 256, (b * lum) / 256);
    } else {
    WS2811_SetDiodeRGB(Ws28b11_Segments[mActualSegment].IdStop - i,  (r * lum) / 256, (g * lum) / 256, (b * lum) / 256);
    }
  }
  Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) % 256;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * twinkle function
 */
void twinkle(uint32_t color1, uint32_t color2)
{
  if(Ws28b11_Segments[mActualSegment].CounterModeStep == 0)
  {
    for(uint16_t i=Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++)
    {
    	WS2811_SetDiodeColor(i, color2);
    }
    uint16_t min_leds = MAX(1, WS2811_LEDS / 5); // make sure, at least one LED is on
    uint16_t max_leds = MAX(1, WS2811_LEDS / 2); // make sure, at least one LED is on
    Ws28b11_Segments[mActualSegment].CounterModeStep = rand() % (max_leds + 1 - min_leds) + min_leds;
  }

  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + rand() % SEGMENT_LENGTH, color1);

  Ws28b11_Segments[mActualSegment].CounterModeStep--;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}

/*
 * Blink several LEDs on, reset, repeat.
 * Inspired by www.tweaking4all.com/hardware/arduino/arduino-led-strip-effects/
 */
void mode_twinkle(void)
{
  return twinkle(Ws28b11_Segments[mActualSegment].ModeColor[0], Ws28b11_Segments[mActualSegment].ModeColor[1]);
}

/*
 * Blink several LEDs in random colors on, reset, repeat.
 * Inspired by www.tweaking4all.com/hardware/arduino/arduino-led-strip-effects/
 */
void mode_twinkle_random(void)
{
  return twinkle(color_wheel(rand() % 256), Ws28b11_Segments[mActualSegment].ModeColor[1]);
}

/*
 * twinkle_fade function
 */
void twinkle_fade(uint32_t color)
{
  fade_out();

  if((rand() %3) == 0)
  {
	  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + rand() % SEGMENT_LENGTH, color);
  }
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * Blink several LEDs on, fading out.
 */
void mode_twinkle_fade(void)
{
  twinkle_fade(Ws28b11_Segments[mActualSegment].ModeColor[0]);
}


/*
 * Blink several LEDs in random colors on, fading out.
 */
void mode_twinkle_fade_random(void)
{
  twinkle_fade(color_wheel(rand() % 256));
}

/*
 * Blinks one LED at a time.
 * Inspired by www.tweaking4all.com/hardware/arduino/arduino-led-strip-effects/
 */
void mode_sparkle(void)
{
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + Ws28b11_Segments[mActualSegment].AuxParam16b, Ws28b11_Segments[mActualSegment].ModeColor[1]);
  Ws28b11_Segments[mActualSegment].AuxParam16b = rand() % SEGMENT_LENGTH; // aux_param3 stores the random led index
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + Ws28b11_Segments[mActualSegment].AuxParam16b, Ws28b11_Segments[mActualSegment].ModeColor[0]);
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


