Janek1986/stm32g071_ws2811/Core/Src/ws2811_fx.c
/*
 * Lights all LEDs in the color. Flashes single white pixels randomly.
 * Inspired by www.tweaking4all.com/hardware/arduino/arduino-led-strip-effects/
 */
void mode_flash_sparkle(void)
{
  if(Ws28b11_Segments[mActualSegment].CounterModeCall == 0)
  {
    for(uint16_t i=Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++)
    {
      WS2811_SetDiodeColor(i, Ws28b11_Segments[mActualSegment].ModeColor[0]);
    }
  }

  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + Ws28b11_Segments[mActualSegment].AuxParam16b, Ws28b11_Segments[mActualSegment].ModeColor[0]);

  if(rand() % 5 == 0)
  {
    Ws28b11_Segments[mActualSegment].AuxParam16b = rand() % SEGMENT_LENGTH; // aux_param3 stores the random led index
    WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + Ws28b11_Segments[mActualSegment].AuxParam16b, WHITE);
    Ws28b11_Segments[mActualSegment].ModeDelay = 20;
  }
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * Like flash sparkle. With more flash.
 * Inspired by www.tweaking4all.com/hardware/arduino/arduino-led-strip-effects/
 */
void mode_hyper_sparkle(void)
{
  for(uint16_t i=Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++)
  {
    WS2811_SetDiodeColor(i, Ws28b11_Segments[mActualSegment].ModeColor[0]);
  }

  if(rand() % 5 < 2)
  {
    for(uint16_t i=0; i < MAX(1, SEGMENT_LENGTH/3); i++)
    {
      WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + rand() % SEGMENT_LENGTH, WHITE);
    }
    Ws28b11_Segments[mActualSegment].ModeDelay = 20;
  }
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}

/*
 * Strobe effect with different strobe count and pause, controlled by speed.
 */
void mode_multi_strobe(void)
{
  for(uint16_t i=Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++)
  {
	  WS2811_SetDiodeColor(i, BLACK);
  }

  uint16_t delay = 200 + ((9 - (Ws28b11_Segments[mActualSegment].Speed % 10)) * 100);
  uint16_t count = 2 * ((Ws28b11_Segments[mActualSegment].Speed / 100) + 1);
  if(Ws28b11_Segments[mActualSegment].CounterModeStep < count)
  {
    if((Ws28b11_Segments[mActualSegment].CounterModeStep & 1) == 0)
    {
      for(uint16_t i=Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++)
      {
    	  WS2811_SetDiodeColor(i, Ws28b11_Segments[mActualSegment].ModeColor[0]);
      }
      delay = 20;
    }
    else
    {
      delay = 50;
    }
  }
  Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) % (count + 1);
  Ws28b11_Segments[mActualSegment].ModeDelay = delay;
}

/*
 * color chase function.
 * color1 = background color
 * color2 and color3 = colors of two adjacent leds
 */
void chase(uint32_t color1, uint32_t color2, uint32_t color3)
{
  uint16_t a = Ws28b11_Segments[mActualSegment].CounterModeStep;
  uint16_t b = (a + 1) % SEGMENT_LENGTH;
  uint16_t c = (b + 1) % SEGMENT_LENGTH;
  if(IS_REVERSE) {
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - a, color1);
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - b, color2);
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - c, color3);
  } else {
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + a, color1);
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + b, color2);
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + c, color3);
  }

  if(b == 0) Ws28b11_Segments[mActualSegment].Cycle = 1;
  else Ws28b11_Segments[mActualSegment].Cycle = 0;

  Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) % WS2811_LEDS;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * Bicolor chase mode
 */
void mode_bicolor_chase(void)
{
  return chase(Ws28b11_Segments[mActualSegment].ModeColor[0], Ws28b11_Segments[mActualSegment].ModeColor[1], Ws28b11_Segments[mActualSegment].ModeColor[2]);
}


/*
 * White running on _color.
 */
void mode_chase_color(void)
{
  return chase(Ws28b11_Segments[mActualSegment].ModeColor[0], WHITE, WHITE);
}


/*
 * Black running on _color.
 */
void mode_chase_blackout(void)
{
  return chase(Ws28b11_Segments[mActualSegment].ModeColor[0], BLACK, BLACK);
}


/*
 * _color running on white.
 */
void mode_chase_white(void)
{
  return chase(WHITE, Ws28b11_Segments[mActualSegment].ModeColor[0], Ws28b11_Segments[mActualSegment].ModeColor[0]);
}


/*
 * White running followed by random color.
 */
void mode_chase_random(void)
{
  if(Ws28b11_Segments[mActualSegment].CounterModeStep == 0)
  {
    Ws28b11_Segments[mActualSegment].AuxParam = get_random_wheel_index(Ws28b11_Segments[mActualSegment].AuxParam);
  }
  return chase(color_wheel(Ws28b11_Segments[mActualSegment].AuxParam), WHITE, WHITE);
}


/*
 * Rainbow running on white.
 */
void mode_chase_rainbow_white(void)
{
  uint16_t n = Ws28b11_Segments[mActualSegment].CounterModeStep;
  uint16_t m = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) % WS2811_LEDS;
  uint32_t color2 = color_wheel(((n * 256 / SEGMENT_LENGTH) + (Ws28b11_Segments[mActualSegment].CounterModeCall & 0xFF)) & 0xFF);
  uint32_t color3 = color_wheel(((m * 256 / SEGMENT_LENGTH) + (Ws28b11_Segments[mActualSegment].CounterModeCall & 0xFF)) & 0xFF);

  return chase(WHITE, color2, color3);
}


/*
 * White running on rainbow.
 */
void mode_chase_rainbow(void)
{
  uint8_t color_sep = 256 / SEGMENT_LENGTH;
  uint8_t color_index = Ws28b11_Segments[mActualSegment].CounterModeCall & 0xFF;
  uint32_t color = color_wheel(((Ws28b11_Segments[mActualSegment].CounterModeStep * color_sep) + color_index) & 0xFF);

  return chase(color, WHITE, WHITE);
}


/*
 * Black running on rainbow.
 */
void mode_chase_blackout_rainbow(void)
{
  uint8_t color_sep = 256 / SEGMENT_LENGTH;
  uint8_t color_index = Ws28b11_Segments[mActualSegment].CounterModeCall & 0xFF;
  uint32_t color = color_wheel(((Ws28b11_Segments[mActualSegment].CounterModeStep * color_sep) + color_index) & 0xFF);

  return chase(color, 0, 0);
}

