Janek1986/stm32g071_ws2811/Core/Src/ws2811_fx.c
/*
 * White flashes running on _color.
 */
void mode_chase_flash(void)
{
  const static uint8_t flash_count = 4;
  uint8_t flash_step = Ws28b11_Segments[mActualSegment].CounterModeCall % ((flash_count * 2) + 1);

  for(uint16_t i=Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++)
  {
    WS2811_SetDiodeColor(i, Ws28b11_Segments[mActualSegment].ModeColor[0]);
  }

  uint16_t delay = Ws28b11_Segments[mActualSegment].Speed;
  if(flash_step < (flash_count * 2))
  {
    if(flash_step % 2 == 0)
    {
      uint16_t n = Ws28b11_Segments[mActualSegment].CounterModeStep;
      uint16_t m = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) % SEGMENT_LENGTH;
      if(IS_REVERSE)
      {
      WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - n, WHITE);
      WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - m, WHITE);
      }
      else
      {
        WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + n, WHITE);
        WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + m, WHITE);
      }
      delay = 20;
    }
    else
    {
      delay = 30;
    }
  }
  else
  {
    Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) % SEGMENT_LENGTH;
  }
  Ws28b11_Segments[mActualSegment].ModeDelay = delay;
}


/*
 * White flashes running, followed by random color.
 */
void mode_chase_flash_random(void)
{
  const static uint8_t flash_count = 4;
  uint8_t flash_step = Ws28b11_Segments[mActualSegment].CounterModeCall % ((flash_count * 2) + 1);

  for(uint16_t i=0; i < Ws28b11_Segments[mActualSegment].CounterModeStep; i++)
  {
    WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + i, color_wheel(Ws28b11_Segments[mActualSegment].AuxParam));
  }

  uint16_t delay = Ws28b11_Segments[mActualSegment].Speed;
  if(flash_step < (flash_count * 2))
  {
    uint16_t n = Ws28b11_Segments[mActualSegment].CounterModeStep;
    uint16_t m = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) % SEGMENT_LENGTH;
    if(flash_step % 2 == 0)
    {
      WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + n, WHITE);
      WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + m, WHITE);
      delay = 20;
    }
    else
    {
      WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + n, color_wheel(Ws28b11_Segments[mActualSegment].AuxParam));
      WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + m, BLACK);
      delay = 30;
    }
  }
  else
  {
    Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) % SEGMENT_LENGTH;

    if(Ws28b11_Segments[mActualSegment].CounterModeStep == 0)
    {
      Ws28b11_Segments[mActualSegment].AuxParam = get_random_wheel_index(Ws28b11_Segments[mActualSegment].AuxParam);
    }
  }
  Ws28b11_Segments[mActualSegment].ModeDelay = delay;
}


/*
 * Alternating pixels running function.
 */
void running(uint32_t color1, uint32_t color2)
{
  for(uint16_t i=0; i < SEGMENT_LENGTH; i++)
  {
    if((i + Ws28b11_Segments[mActualSegment].CounterModeStep) % 4 < 2)
    {
      if(IS_REVERSE) {
    	  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + i, color1);
      } else {
        WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - i, color1);
      }
    } else {
      if(IS_REVERSE) {
        WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + i, color1);
      } else {
        WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - i, color2);
      }
    }
  }

  Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) & 0x3;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}

/*
 * Alternating color/white pixels running.
 */
void mode_running_color(void)
{
  return running(Ws28b11_Segments[mActualSegment].ModeColor[0], WHITE);
}


/*
 * Alternating red/blue pixels running.
 */
void mode_running_red_blue(void)
{
  return running(RED, BLUE);
}


/*
 * Alternating red/green pixels running.
 */
void mode_merry_christmas(void)
{
  return running(RED, GREEN);
}

/*
 * Alternating orange/purple pixels running.
 */
void mode_halloween(void)
{
  return running(PURPLE, ORANGE);
}

/*
 * Random colored pixels running.
 */
void mode_running_random(void) {
  for(uint16_t i=SEGMENT_LENGTH-1; i > 0; i--) {
    if(IS_REVERSE) {
    	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - i, WS2811_GetColor(Ws28b11_Segments[mActualSegment].IdStop - i + 1));
    } else {
    	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + i, WS2811_GetColor(Ws28b11_Segments[mActualSegment].IdStart + i - 1));
    }
  }

  if(Ws28b11_Segments[mActualSegment].CounterModeStep == 0)
  {
    Ws28b11_Segments[mActualSegment].AuxParam = get_random_wheel_index(Ws28b11_Segments[mActualSegment].AuxParam);
    if(IS_REVERSE) {
    	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop, color_wheel(Ws28b11_Segments[mActualSegment].AuxParam));
    } else {
    	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart, color_wheel(Ws28b11_Segments[mActualSegment].AuxParam));
    }
  }

  Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep == 0) ? 1 : 0;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * K.I.T.T.
 */
void mode_larson_scanner(void) {
  fade_out();

  if(Ws28b11_Segments[mActualSegment].CounterModeStep < SEGMENT_LENGTH)
  {
    if(IS_REVERSE) {
    	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - Ws28b11_Segments[mActualSegment].CounterModeStep, Ws28b11_Segments[mActualSegment].ModeColor[0]);
    } else {
    	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + Ws28b11_Segments[mActualSegment].CounterModeStep, Ws28b11_Segments[mActualSegment].ModeColor[0]);
    }
  }
  else
  {
    if(IS_REVERSE) {
    	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - ((SEGMENT_LENGTH * 2) - Ws28b11_Segments[mActualSegment].CounterModeStep) + 2, Ws28b11_Segments[mActualSegment].ModeColor[0]);
    } else {
    	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + ((SEGMENT_LENGTH * 2) - Ws28b11_Segments[mActualSegment].CounterModeStep) - 2, Ws28b11_Segments[mActualSegment].ModeColor[0]);
    }
  }

  if(Ws28b11_Segments[mActualSegment].CounterModeStep % SEGMENT_LENGTH  == 0) Ws28b11_Segments[mActualSegment].Cycle = 1;
  else Ws28b11_Segments[mActualSegment].Cycle = 1;

  Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) % ((SEGMENT_LENGTH * 2) - 2);
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


