Janek1986/stm32g071_ws2811/Core/Src/ws2811_fx.c
/*
 * Firing comets from one end.
 */
void mode_comet(void) {
  fade_out();

  if(IS_REVERSE) {
	  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - Ws28b11_Segments[mActualSegment].CounterModeStep, Ws28b11_Segments[mActualSegment].ModeColor[0]);
  } else {
	  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + Ws28b11_Segments[mActualSegment].CounterModeStep, Ws28b11_Segments[mActualSegment].ModeColor[0]);
  }

  Ws28b11_Segments[mActualSegment].CounterModeStep = (Ws28b11_Segments[mActualSegment].CounterModeStep + 1) % SEGMENT_LENGTH;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * Fireworks function.
 */
void fireworks(uint32_t color) {
  fade_out();

//// set brightness(i) = brightness(i-1)/4 + brightness(i) + brightness(i+1)/4
/*
// the old way, so many calls to the pokey getPixelColor() function made this super slow
  for(uint16_t i=0 + 1; i <WS2811_LEDS; i++) {
    uint32_t prevLed = (Adafruit_NeoPixel::getPixelColor(i-1) >> 2) & 0x3F3F3F3F;
    uint32_t thisLed = Adafruit_NeoPixel::getPixelColor(i);
    uint32_t nextLed = (Adafruit_NeoPixel::getPixelColor(i+1) >> 2) & 0x3F3F3F3F;
    WS2811_SetDiodeColor(i, prevLed + thisLed + nextLed);
  }
*/

// the new way, manipulate the Adafruit_NeoPixels pixels[] array directly, about 5x faster
  uint8_t *pixels = WS2811_GetPixels();
  uint8_t pixelsPerLed = 3;
  uint16_t startPixel = Ws28b11_Segments[mActualSegment].IdStart * pixelsPerLed + pixelsPerLed;
  uint16_t stopPixel = Ws28b11_Segments[mActualSegment].IdStop * pixelsPerLed ;
  for(uint16_t i=startPixel; i <stopPixel; i++)
  {
    uint16_t tmpPixel = (pixels[i - pixelsPerLed] >> 2) +
      pixels[i] +
      (pixels[i + pixelsPerLed] >> 2);
    pixels[i] =  tmpPixel > 255 ? 255 : tmpPixel;
  }

  if(!mTriggered)
  {
    for(uint16_t i=0; i<MAX(1, WS2811_LEDS/20); i++)
    {
      if(rand()%10 == 0)
      {
        WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + rand() % SEGMENT_LENGTH, color);
      }
    }
  }
  else
  {
    for(uint16_t i=0; i<MAX(1, SEGMENT_LENGTH/10); i++)
    {
      WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + rand() % SEGMENT_LENGTH, color);
    }
  }
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}

/*
 * Firework sparks.
 */
void mode_fireworks(void)
{
  return fireworks(Ws28b11_Segments[mActualSegment].ModeColor[0]);
}

/*
 * Random colored firework sparks.
 */
void mode_fireworks_random(void)
{
  return fireworks(color_wheel(rand()%256));
}


/*
 * Fire flicker function
 */
void fire_flicker(int rev_intensity)
{
  uint8_t r = (Ws28b11_Segments[mActualSegment].ModeColor[0] >> 16) & 0xFF;
  uint8_t g = (Ws28b11_Segments[mActualSegment].ModeColor[0] >>  8) & 0xFF;
  uint8_t b = (Ws28b11_Segments[mActualSegment].ModeColor[0]        & 0xFF);
  uint8_t lum = MAX(r, MAX(g, b)) / rev_intensity;
  for(uint16_t i=Ws28b11_Segments[mActualSegment].IdStart; i <= Ws28b11_Segments[mActualSegment].IdStop; i++)
  {
    int flicker = rand()%lum;
    WS2811_SetDiodeRGB(i, MAX(r - flicker, 0), MAX(g - flicker, 0), MAX(b - flicker, 0));
  }
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}

/*
 * Random flickering.
 */
void mode_fire_flicker(void)
{
  return fire_flicker(3);
}

/*
* Random flickering, less intensity.
*/
void mode_fire_flicker_soft(void)
{
  return fire_flicker(6);
}

/*
* Random flickering, more intensity.
*/
void mode_fire_flicker_intense(void)
{
  return fire_flicker(1.7);
}


/*
 * Tricolor chase function
 */
void tricolor_chase(uint32_t color1, uint32_t color2, uint32_t color3)
{
  uint16_t index = Ws28b11_Segments[mActualSegment].CounterModeStep % 6;
  for(uint16_t i=0; i < SEGMENT_LENGTH; i++, index++)
  {
    if(index > 5) index = 0;

    uint32_t color = color3;
    if(index < 2) color = color1;
    else if(index < 4) color = color2;

    if(IS_REVERSE) {
    	WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + i, color);
    } else {
      WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStop - i, color);
    }
  }

  Ws28b11_Segments[mActualSegment].CounterModeStep++;
  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}


/*
 * Tricolor chase mode
 */
void mode_tricolor_chase(void)
{
  return tricolor_chase(Ws28b11_Segments[mActualSegment].ModeColor[0], Ws28b11_Segments[mActualSegment].ModeColor[1], Ws28b11_Segments[mActualSegment].ModeColor[2]);
}


/*
 * Alternating white/red/black pixels running.
 */
void mode_circus_combustus(void)
{
  return tricolor_chase(RED, WHITE, BLACK);
}

/*
 * ICU mode
 */
void mode_icu(void)
{
  uint16_t dest = Ws28b11_Segments[mActualSegment].CounterModeStep & 0xFFFF;

  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + dest, Ws28b11_Segments[mActualSegment].ModeColor[0]);
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + dest + WS2811_LEDS/2, Ws28b11_Segments[mActualSegment].ModeColor[0]);

  if(Ws28b11_Segments[mActualSegment].AuxParam16b == dest)
  { // pause between eye movements
    if(rand()%6 == 0)
    { // blink once in a while
      WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + dest, BLACK);
      WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + dest + SEGMENT_LENGTH/2, BLACK);
      Ws28b11_Segments[mActualSegment].ModeDelay = 200;
    }
    Ws28b11_Segments[mActualSegment].AuxParam16b = rand() %(SEGMENT_LENGTH/2);
    Ws28b11_Segments[mActualSegment].ModeDelay = 1000 + rand() %2000;
  }

  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + dest, BLACK);
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + dest + SEGMENT_LENGTH/2, BLACK);

  if(Ws28b11_Segments[mActualSegment].AuxParam16b > Ws28b11_Segments[mActualSegment].CounterModeStep)
  {
    Ws28b11_Segments[mActualSegment].CounterModeStep++;
    dest++;
  } else if (Ws28b11_Segments[mActualSegment].AuxParam16b < Ws28b11_Segments[mActualSegment].CounterModeStep)
  {
    Ws28b11_Segments[mActualSegment].CounterModeStep--;
    dest--;
  }

  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + dest, Ws28b11_Segments[mActualSegment].ModeColor[0]);
  WS2811_SetDiodeColor(Ws28b11_Segments[mActualSegment].IdStart + dest + SEGMENT_LENGTH/2, Ws28b11_Segments[mActualSegment].ModeColor[0]);

  Ws28b11_Segments[mActualSegment].ModeDelay = Ws28b11_Segments[mActualSegment].Speed;
}
